# Terraform Plan for int
#### Terraform Plan (may be truncated to 100kbytes)
<details><summary>Show Plan</summary>
```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.my-cdn-cf-policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "my-cdn-cf-policy"  {
      ~ id      = "3749697326" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity EJIYX83IXYI2E"
                        }
                      - Resource  = "arn:aws:s3:::beatsnext-dev/*"
                      - Sid       = "1"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:s3:::beatsnext-dev/*",
              ~ (known after apply),
            ]
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # aws_cloudfront_origin_access_identity.my-oai will be updated in-place
  ~ resource "aws_cloudfront_origin_access_identity" "my-oai" {
      ~ comment                         = "beatsnext-dev" -> "beatsnext-int"
        id                              = "EJIYX83IXYI2E"
        # (5 unchanged attributes hidden)
    }

  # aws_s3_bucket.beats-nextjs-bucket must be replaced
-/+ resource "aws_s3_bucket" "beats-nextjs-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::beatsnext-dev" -> (known after apply)
      ~ bucket                      = "beatsnext-dev" -> "beatsnext-int"
      ~ bucket_domain_name          = "beatsnext-dev.s3.amazonaws.com" -> (known after apply)
      ~ bucket_regional_domain_name = "beatsnext-dev.s3.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)
      ~ id                          = "beatsnext-dev" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      ~ policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity EJIYX83IXYI2E"
                        }
                      - Resource  = "arn:aws:s3:::beatsnext-dev/*"
                      - Sid       = "1"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ region                      = "us-east-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      ~ tags_all                    = {} -> (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (1 unchanged attribute hidden)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      - grant {
          - id          = "c606020a98042b1470ecb961a7b56ad07da9a432eeddecf4eee6a79ec6961d89" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }
      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      ~ server_side_encryption_configuration {
          ~ rule {
              ~ bucket_key_enabled = false -> (known after apply)

              ~ apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  ~ sse_algorithm     = "AES256" -> (known after apply)
                }
            }
        }

      ~ versioning {
          ~ enabled    = false -> (known after apply)
          ~ mfa_delete = false -> (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # aws_s3_bucket_object.dist["BUILD_ID"] must be replaced
-/+ resource "aws_s3_bucket_object" "dist" {
      ~ bucket                 = "beatsnext-dev" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ etag                   = "83a0635324a7da43eb776d4878c5ce84" -> "6cf88e41ddad7cc2508b66f631d92f22"
      ~ id                     = "BUILD_ID" -> (known after apply)
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # aws_s3_bucket_object.dist["_next/data/YBQFxUxBZTm2-WFsAQXGb/about.json"] will be created
  + resource "aws_s3_bucket_object" "dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "public, max-age=0, s-maxage=2678400, must-revalidate"
      + content_type           = "application/json"
      + etag                   = "1379645591a88d5b9dd553d257fb9b9a"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "_next/data/YBQFxUxBZTm2-WFsAQXGb/about.json"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "deploy/.serverless_nextjs/assets/_next/data/YBQFxUxBZTm2-WFsAQXGb/about.json"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_bucket_object.dist["_next/data/YBQFxUxBZTm2-WFsAQXGb/videos/6182b67ff47455000893d5d1gh.json"] will be created
  + resource "aws_s3_bucket_object" "dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "public, max-age=0, s-maxage=2678400, must-revalidate"
      + content_type           = "application/json"
      + etag                   = "3a28abec2322c7814bea2fc489edffe5"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "_next/data/YBQFxUxBZTm2-WFsAQXGb/videos/6182b67ff47455000893d5d1gh.json"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "deploy/.serverless_nextjs/assets/_next/data/YBQFxUxBZTm2-WFsAQXGb/videos/6182b67ff47455000893d5d1gh.json"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_bucket_object.dist["_next/data/uZlWZsByzoqGyMtdzGd7y/about.json"] will be destroyed
  - resource "aws_s3_bucket_object" "dist" {
      - acl                    = "private" -> null
      - bucket                 = "beatsnext-dev" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "public, max-age=0, s-maxage=2678400, must-revalidate" -> null
      - content_type           = "application/json" -> null
      - etag                   = "1379645591a88d5b9dd553d257fb9b9a" -> null
      - force_destroy          = false -> null
      - id                     = "_next/data/uZlWZsByzoqGyMtdzGd7y/about.json" -> null
      - key                    = "_next/data/uZlWZsByzoqGyMtdzGd7y/about.json" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "deploy/.serverless_nextjs/assets/_next/data/uZlWZsByzoqGyMtdzGd7y/about.json" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_bucket_object.dist["_next/data/uZlWZsByzoqGyMtdzGd7y/videos/6182b67ff47455000893d5d1gh.json"] will be destroyed
  - resource "aws_s3_bucket_object" "dist" {
      - acl                    = "private" -> null
      - bucket                 = "beatsnext-dev" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "public, max-age=0, s-maxage=2678400, must-revalidate" -> null
      - content_type           = "application/json" -> null
      - etag                   = "3a28abec2322c7814bea2fc489edffe5" -> null
      - force_destroy          = false -> null
      - id                     = "_next/data/uZlWZsByzoqGyMtdzGd7y/videos/6182b67ff47455000893d5d1gh.json" -> null
      - key                    = "_next/data/uZlWZsByzoqGyMtdzGd7y/videos/6182b67ff47455000893d5d1gh.json" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "deploy/.serverless_nextjs/assets/_next/data/uZlWZsByzoqGyMtdzGd7y/videos/6182b67ff47455000893d5d1gh.json" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_bucket_object.dist["_next/static/YBQFxUxBZTm2-WFsAQXGb/_buildManifest.js"] will be created
  + resource "aws_s3_bucket_object" "dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "public, max-age=0, s-maxage=2678400, must-revalidate"
      + content_type           = "application/javascript"
      + etag                   = "7d98bae0ce9e19b37963ecc88c0e5954"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "_next/static/YBQFxUxBZTm2-WFsAQXGb/_buildManifest.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "deploy/.serverless_nextjs/assets/_next/static/YBQFxUxBZTm2-WFsAQXGb/_buildManifest.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_bucket_object.dist["_next/static/YBQFxUxBZTm2-WFsAQXGb/_middlewareManifest.js"] will be created
  + resource "aws_s3_bucket_object" "dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "public, max-age=0, s-maxage=2678400, must-revalidate"
      + content_type           = "application/javascript"
      + etag                   = "7c3f7e060745668041278118c0bb3d6d"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "_next/static/YBQFxUxBZTm2-WFsAQXGb/_middlewareManifest.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "deploy/.serverless_nextjs/assets/_next/static/YBQFxUxBZTm2-WFsAQXGb/_middlewareManifest.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_bucket_object.dist["_next/static/YBQFxUxBZTm2-WFsAQXGb/_ssgManifest.js"] will be created
  + resource "aws_s3_bucket_object" "dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "public, max-age=0, s-maxage=2678400, must-revalidate"
      + content_type           = "application/javascript"
      + etag                   = "594d60bd681cd2e36e7917604c5a3765"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "_next/static/YBQFxUxBZTm2-WFsAQXGb/_ssgManifest.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "deploy/.serverless_nextjs/assets/_next/static/YBQFxUxBZTm2-WFsAQXGb/_ssgManifest.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_bucket_object.dist["_next/static/chunks/framework-d4c7fbe780b853ea.js"] must be replaced
-/+ resource "aws_s3_bucket_object" "dist" {
      ~ bucket                 = "beatsnext-dev" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ id                     = "_next/static/chunks/framework-d4c7fbe780b853ea.js" -> (known after apply)
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_s3_bucket_object.dist["_next/static/chunks/main-15f66ec6222305d1.js"] must be replaced
-/+ resource "aws_s3_bucket_object" "dist" {
      ~ bucket                 = "beatsnext-dev" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ id                     = "_next/static/chunks/main-15f66ec6222305d1.js" -> (known after apply)
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_s3_bucket_object.dist["_next/static/chunks/pages/_app-c4b2c13a9bef782b.js"] must be replaced
-/+ resource "aws_s3_bucket_object" "dist" {
      ~ bucket                 = "beatsnext-dev" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ id                     = "_next/static/chunks/pages/_app-c4b2c13a9bef782b.js" -> (known after apply)
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_s3_bucket_object.dist["_next/static/chunks/pages/_error-5f79c00932c7c9f1.js"] must be replaced
-/+ resource "aws_s3_bucket_object" "dist" {
      ~ bucket                 = "beatsnext-dev" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ id                     = "_next/static/chunks/pages/_error-5f79c00932c7c9f1.js" -> (known after apply)
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_s3_bucket_object.dist["_next/static/chunks/pages/about-69e459db8ced1251.js"] will be created
  + resource "aws_s3_bucket_object" "dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "public, max-age=0, s-maxage=2678400, must-revalidate"
      + content_type           = "application/javascript"
      + etag                   = "68bd119fff2a474c893f768f1a914c23"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "_next/static/chunks/pages/about-69e459db8ced1251.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "deploy/.serverless_nextjs/assets/_next/static/chunks/pages/about-69e459db8ced1251.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_bucket_object.dist["_next/static/chunks/pages/about-7cdf3428c5c3a536.js"] will be destroyed
  - resource "aws_s3_bucket_object" "dist" {
      - acl                    = "private" -> null
      - bucket                 = "beatsnext-dev" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "public, max-age=0, s-maxage=2678400, must-revalidate" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "c7113c278756fdede572698715cd4a30" -> null
      - force_destroy          = false -> null
      - id                     = "_next/static/chunks/pages/about-7cdf3428c5c3a536.js" -> null
      - key                    = "_next/static/chunks/pages/about-7cdf3428c5c3a536.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "deploy/.serverless_nextjs/assets/_next/static/chunks/pages/about-7cdf3428c5c3a536.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_bucket_object.dist["_next/static/chunks/pages/index-4c45b77940d9506f.js"] must be replaced
-/+ resource "aws_s3_bucket_object" "dist" {
      ~ bucket                 = "beatsnext-dev" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ id                     = "_next/static/chunks/pages/index-4c45b77940d9506f.js" -> (known after apply)
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_s3_bucket_object.dist["_next/static/chunks/pages/videos/[slug]-280c866d06debdbe.js"] must be replaced
-/+ resource "aws_s3_bucket_object" "dist" {
      ~ bucket                 = "beatsnext-dev" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ id                     = "_next/static/chunks/pages/videos/[slug]-280c866d06debdbe.js" -> (known after apply)
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_s3_bucket_object.dist["_next/static/chunks/polyfills-5cd94c89d3acac5f.js"] must be replaced
-/+ resource "aws_s3_bucket_object" "dist" {
      ~ bucket                 = "beatsnext-dev" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ id                     = "_next/static/chunks/polyfills-5cd94c89d3acac5f.js" -> (known after apply)
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_s3_bucket_object.dist["_next/static/chunks/webpack-69bfa6990bb9e155.js"] must be replaced
-/+ resource "aws_s3_bucket_object" "dist" {
      ~ bucket                 = "beatsnext-dev" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ id                     = "_next/static/chunks/webpack-69bfa6990bb9e155.js" -> (known after apply)
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_s3_bucket_object.dist["_next/static/css/32d668369076d8cb.css"] must be replaced
-/+ resource "aws_s3_bucket_object" "dist" {
      ~ bucket                 = "beatsnext-dev" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ id                     = "_next/static/css/32d668369076d8cb.css" -> (known after apply)
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_s3_bucket_object.dist["_next/static/css/ef46db3751d8e999.css"] must be replaced
-/+ resource "aws_s3_bucket_object" "dist" {
      ~ bucket                 = "beatsnext-dev" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ id                     = "_next/static/css/ef46db3751d8e999.css" -> (known after apply)
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_s3_bucket_object.dist["_next/static/uZlWZsByzoqGyMtdzGd7y/_buildManifest.js"] will be destroyed
  - resource "aws_s3_bucket_object" "dist" {
      - acl                    = "private" -> null
      - bucket                 = "beatsnext-dev" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "public, max-age=0, s-maxage=2678400, must-revalidate" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "535687fb0eb73e94d5cc1599f9e317d5" -> null
      - force_destroy          = false -> null
      - id                     = "_next/static/uZlWZsByzoqGyMtdzGd7y/_buildManifest.js" -> null
      - key                    = "_next/static/uZlWZsByzoqGyMtdzGd7y/_buildManifest.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "deploy/.serverless_nextjs/assets/_next/static/uZlWZsByzoqGyMtdzGd7y/_buildManifest.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_bucket_object.dist["_next/static/uZlWZsByzoqGyMtdzGd7y/_middlewareManifest.js"] will be destroyed
  - resource "aws_s3_bucket_object" "dist" {
      - acl                    = "private" -> null
      - bucket                 = "beatsnext-dev" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "public, max-age=0, s-maxage=2678400, must-revalidate" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "7c3f7e060745668041278118c0bb3d6d" -> null
      - force_destroy          = false -> null
      - id                     = "_next/static/uZlWZsByzoqGyMtdzGd7y/_middlewareManifest.js" -> null
      - key                    = "_next/static/uZlWZsByzoqGyMtdzGd7y/_middlewareManifest.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "deploy/.serverless_nextjs/assets/_next/static/uZlWZsByzoqGyMtdzGd7y/_middlewareManifest.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_bucket_object.dist["_next/static/uZlWZsByzoqGyMtdzGd7y/_ssgManifest.js"] will be destroyed
  - resource "aws_s3_bucket_object" "dist" {
      - acl                    = "private" -> null
      - bucket                 = "beatsnext-dev" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "public, max-age=0, s-maxage=2678400, must-revalidate" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "594d60bd681cd2e36e7917604c5a3765" -> null
      - force_destroy          = false -> null
      - id                     = "_next/static/uZlWZsByzoqGyMtdzGd7y/_ssgManifest.js" -> null
      - key                    = "_next/static/uZlWZsByzoqGyMtdzGd7y/_ssgManifest.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "deploy/.serverless_nextjs/assets/_next/static/uZlWZsByzoqGyMtdzGd7y/_ssgManifest.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_bucket_object.dist["public/.gitkeep"] must be replaced
-/+ resource "aws_s3_bucket_object" "dist" {
      ~ bucket                 = "beatsnext-dev" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ id                     = "public/.gitkeep" -> (known after apply)
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_s3_bucket_object.dist["public/icon-192x192.png"] must be replaced
-/+ resource "aws_s3_bucket_object" "dist" {
      ~ bucket                 = "beatsnext-dev" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ id                     = "public/icon-192x192.png" -> (known after apply)
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_s3_bucket_object.dist["public/icon-256x256.png"] must be replaced
-/+ resource "aws_s3_bucket_object" "dist" {
      ~ bucket                 = "beatsnext-dev" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ id                     = "public/icon-256x256.png" -> (known after apply)
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_s3_bucket_object.dist["public/icon-384x384.png"] must be replaced
-/+ resource "aws_s3_bucket_object" "dist" {
      ~ bucket                 = "beatsnext-dev" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ id                     = "public/icon-384x384.png" -> (known after apply)
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_s3_bucket_object.dist["public/icon-512x512.png"] must be replaced
-/+ resource "aws_s3_bucket_object" "dist" {
      ~ bucket                 = "beatsnext-dev" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ id                     = "public/icon-512x512.png" -> (known after apply)
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_s3_bucket_object.dist["public/manifest.json"] must be replaced
-/+ resource "aws_s3_bucket_object" "dist" {
      ~ bucket                 = "beatsnext-dev" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ id                     = "public/manifest.json" -> (known after apply)
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_s3_bucket_object.dist["public/sw.js"] must be replaced
-/+ resource "aws_s3_bucket_object" "dist" {
      ~ bucket                 = "beatsnext-dev" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ etag                   = "72b4f1f865b4d374e1a142f6a431daac" -> "86992250ebf142860abf1c03d74895f2"
      ~ id                     = "public/sw.js" -> (known after apply)
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # aws_s3_bucket_object.dist["public/workbox-2780d724.js"] must be replaced
-/+ resource "aws_s3_bucket_object" "dist" {
      ~ bucket                 = "beatsnext-dev" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ id                     = "public/workbox-2780d724.js" -> (known after apply)
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_s3_bucket_object.dist["static-pages/YBQFxUxBZTm2-WFsAQXGb/404.html"] will be created
  + resource "aws_s3_bucket_object" "dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "public, max-age=0, s-maxage=2678400, must-revalidate"
      + content_type           = "text/html; charset=utf-8"
      + etag                   = "581ad6c998a65d2f9a667fa939799f4d"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static-pages/YBQFxUxBZTm2-WFsAQXGb/404.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "deploy/.serverless_nextjs/assets/static-pages/YBQFxUxBZTm2-WFsAQXGb/404.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_bucket_object.dist["static-pages/YBQFxUxBZTm2-WFsAQXGb/about.html"] will be created
  + resource "aws_s3_bucket_object" "dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "public, max-age=0, s-maxage=2678400, must-revalidate"
      + content_type           = "text/html; charset=utf-8"
      + etag                   = "d38a5918e6b0d0c460a47e5630b15261"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static-pages/YBQFxUxBZTm2-WFsAQXGb/about.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "deploy/.serverless_nextjs/assets/static-pages/YBQFxUxBZTm2-WFsAQXGb/about.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_bucket_object.dist["static-pages/YBQFxUxBZTm2-WFsAQXGb/index.html"] will be created
  + resource "aws_s3_bucket_object" "dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "public, max-age=0, s-maxage=2678400, must-revalidate"
      + content_type           = "text/html; charset=utf-8"
      + etag                   = "1cf42ab3651dce87bcc10379b6c06e08"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static-pages/YBQFxUxBZTm2-WFsAQXGb/index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "deploy/.serverless_nextjs/assets/static-pages/YBQFxUxBZTm2-WFsAQXGb/index.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_bucket_object.dist["static-pages/YBQFxUxBZTm2-WFsAQXGb/videos/6182b67ff47455000893d5d1gh.html"] will be created
  + resource "aws_s3_bucket_object" "dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "public, max-age=0, s-maxage=2678400, must-revalidate"
      + content_type           = "text/html; charset=utf-8"
      + etag                   = "5632e295f296ed647f69cbcb0dfe4541"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static-pages/YBQFxUxBZTm2-WFsAQXGb/videos/6182b67ff47455000893d5d1gh.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "deploy/.serverless_nextjs/assets/static-pages/YBQFxUxBZTm2-WFsAQXGb/videos/6182b67ff47455000893d5d1gh.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_bucket_object.dist["static-pages/YBQFxUxBZTm2-WFsAQXGb/videos/[slug].html"] will be created
  + resource "aws_s3_bucket_object" "dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "public, max-age=0, s-maxage=2678400, must-revalidate"
      + content_type           = "text/html; charset=utf-8"
      + etag                   = "a484696b5fda3b3bb0461eed044c8a29"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static-pages/YBQFxUxBZTm2-WFsAQXGb/videos/[slug].html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "deploy/.serverless_nextjs/assets/static-pages/YBQFxUxBZTm2-WFsAQXGb/videos/[slug].html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_bucket_object.dist["static-pages/uZlWZsByzoqGyMtdzGd7y/404.html"] will be destroyed
  - resource "aws_s3_bucket_object" "dist" {
      - acl                    = "private" -> null
      - bucket                 = "beatsnext-dev" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "public, max-age=0, s-maxage=2678400, must-revalidate" -> null
      - content_type           = "text/html; charset=utf-8" -> null
      - etag                   = "438894502a5adecc5e00e1cae36d2a05" -> null
      - force_destroy          = false -> null
      - id                     = "static-pages/uZlWZsByzoqGyMtdzGd7y/404.html" -> null
      - key                    = "static-pages/uZlWZsByzoqGyMtdzGd7y/404.html" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "deploy/.serverless_nextjs/assets/static-pages/uZlWZsByzoqGyMtdzGd7y/404.html" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_bucket_object.dist["static-pages/uZlWZsByzoqGyMtdzGd7y/about.html"] will be destroyed
  - resource "aws_s3_bucket_object" "dist" {
      - acl                    = "private" -> null
      - bucket                 = "beatsnext-dev" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "public, max-age=0, s-maxage=2678400, must-revalidate" -> null
      - content_type           = "text/html; charset=utf-8" -> null
      - etag                   = "659146f7f4d727c5dd33b1bed9c9234c" -> null
      - force_destroy          = false -> null
      - id                     = "static-pages/uZlWZsByzoqGyMtdzGd7y/about.html" -> null
      - key                    = "static-pages/uZlWZsByzoqGyMtdzGd7y/about.html" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "deploy/.serverless_nextjs/assets/static-pages/uZlWZsByzoqGyMtdzGd7y/about.html" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_bucket_object.dist["static-pages/uZlWZsByzoqGyMtdzGd7y/index.html"] will be destroyed
  - resource "aws_s3_bucket_object" "dist" {
      - acl                    = "private" -> null
      - bucket                 = "beatsnext-dev" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "public, max-age=0, s-maxage=2678400, must-revalidate" -> null
      - content_type           = "text/html; charset=utf-8" -> null
      - etag                   = "c88c956b770662203dfba349232d1eb4" -> null
      - force_destroy          = false -> null
      - id                     = "static-pages/uZlWZsByzoqGyMtdzGd7y/index.html" -> null
      - key                    = "static-pages/uZlWZsByzoqGyMtdzGd7y/index.html" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "deploy/.serverless_nextjs/assets/static-pages/uZlWZsByzoqGyMtdzGd7y/index.html" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_bucket_object.dist["static-pages/uZlWZsByzoqGyMtdzGd7y/videos/6182b67ff47455000893d5d1gh.html"] will be destroyed
  - resource "aws_s3_bucket_object" "dist" {
      - acl                    = "private" -> null
      - bucket                 = "beatsnext-dev" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "public, max-age=0, s-maxage=2678400, must-revalidate" -> null
      - content_type           = "text/html; charset=utf-8" -> null
      - etag                   = "424d471a8f1b321509caee527cbd4437" -> null
      - force_destroy          = false -> null
      - id                     = "static-pages/uZlWZsByzoqGyMtdzGd7y/videos/6182b67ff47455000893d5d1gh.html" -> null
      - key                    = "static-pages/uZlWZsByzoqGyMtdzGd7y/videos/6182b67ff47455000893d5d1gh.html" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "deploy/.serverless_nextjs/assets/static-pages/uZlWZsByzoqGyMtdzGd7y/videos/6182b67ff47455000893d5d1gh.html" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_bucket_object.dist["static-pages/uZlWZsByzoqGyMtdzGd7y/videos/[slug].html"] will be destroyed
  - resource "aws_s3_bucket_object" "dist" {
      - acl                    = "private" -> null
      - bucket                 = "beatsnext-dev" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "public, max-age=0, s-maxage=2678400, must-revalidate" -> null
      - content_type           = "text/html; charset=utf-8" -> null
      - etag                   = "e1e4225b8988692d10bd699106ba7ea2" -> null
      - force_destroy          = false -> null
      - id                     = "static-pages/uZlWZsByzoqGyMtdzGd7y/videos/[slug].html" -> null
      - key                    = "static-pages/uZlWZsByzoqGyMtdzGd7y/videos/[slug].html" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "deploy/.serverless_nextjs/assets/static-pages/uZlWZsByzoqGyMtdzGd7y/videos/[slug].html" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_bucket_policy.cdn-cf-policy must be replaced
-/+ resource "aws_s3_bucket_policy" "cdn-cf-policy" {
      ~ bucket = "beatsnext-dev" -> (known after apply)
      ~ id     = "beatsnext-dev" -> (known after apply)
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity EJIYX83IXYI2E"
                        }
                      - Resource  = "arn:aws:s3:::beatsnext-dev/*"
                      - Sid       = "1"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # module.cloudfront_s3.data.aws_iam_policy_document.lambda_s3_sqs will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_s3_sqs"  {
      ~ id      = "2848390973" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::beatsnext-dev/*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "sqs:SendMessage",
                          - "sqs:ReceiveMessage",
                          - "sqs:GetQueueAttributes",
                          - "sqs:DeleteMessage",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sqs:us-east-1:494055087689:beatsnext-dev-regeneration-nextjs.fifo"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:s3:::beatsnext-dev/*",
              ~ (known after apply),
            ]
            # (1 unchanged attribute hidden)
        }
      ~ statement {
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:sqs:us-east-1:494055087689:beatsnext-dev-regeneration-nextjs.fifo",
              ~ (known after apply),
            ]
            # (1 unchanged attribute hidden)
        }
    }

  # module.cloudfront_s3.aws_cloudfront_distribution.cdn will be created
  + resource "aws_cloudfront_distribution" "cdn" {
      + aliases                        = [
          + "int.beatsnext.com",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = false
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_100"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags_all                       = (known after apply)
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = (known after apply)
          + cached_methods         = (known after apply)
          + compress               = (known after apply)
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = (known after apply)
          + target_origin_id       = (known after apply)
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = (known after apply)

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = (known after apply)
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = (known after apply)
                  + whitelisted_names = (known after apply)
                }
            }

          + lambda_function_association {
              + event_type   = (known after apply)
              + include_body = (known after apply)
              + lambda_arn   = (known after apply)
            }
          + lambda_function_association {
              + event_type   = (known after apply)
              + include_body = (known after apply)
              + lambda_arn   = (known after apply)
            }
        }

      + ordered_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + path_pattern           = "_next/static/*"
          + target_origin_id       = "int.beatsnext.com"
          + viewer_protocol_policy = "https-only"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward = "none"
                }
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + path_pattern           = "static/*"
          + target_origin_id       = "int.beatsnext.com"
          + viewer_protocol_policy = "https-only"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward = "none"
                }
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = (known after apply)
          + cached_methods         = (known after apply)
          + compress               = (known after apply)
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + path_pattern           = (known after apply)
          + target_origin_id       = (known after apply)
          + viewer_protocol_policy = (known after apply)

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = (known after apply)
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward = (known after apply)
                }
            }

          + lambda_function_association {
              + event_type   = (known after apply)
              + include_body = (known after apply)
              + lambda_arn   = (known after apply)
            }
          + lambda_function_association {
              + event_type   = (known after apply)
              + include_body = (known after apply)
              + lambda_arn   = (known after apply)
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = (known after apply)
          + cached_methods         = (known after apply)
          + compress               = (known after apply)
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = (known after apply)
          + path_pattern           = (known after apply)
          + target_origin_id       = (known after apply)
          + viewer_protocol_policy = (known after apply)

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = (known after apply)
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward = (known after apply)
                }
            }

          + lambda_function_association {
              + event_type   = (known after apply)
              + include_body = (known after apply)
              + lambda_arn   = (known after apply)
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = (known after apply)
          + cached_methods         = (known after apply)
          + compress               = (known after apply)
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = (known after apply)
          + path_pattern           = (known after apply)
          + target_origin_id       = (known after apply)
          + viewer_protocol_policy = (known after apply)

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = (known after apply)
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward = (known after apply)
                }
            }

          + lambda_function_association {
              + event_type   = (known after apply)
              + include_body = (known after apply)
              + lambda_arn   = (known after apply)
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = (known after apply)
          + origin_id           = "int.beatsnext.com"

          + s3_origin_config {
              + origin_access_identity = "origin-access-identity/cloudfront/EJIYX83IXYI2E"
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:494055087689:certificate/5f7d43f5-71bb-45af-86c9-296ad3dab240"
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.cloudfront_s3.aws_iam_policy.lambda_s3_sqs must be replaced
-/+ resource "aws_iam_policy" "lambda_s3_sqs" {
      ~ arn         = "arn:aws:iam::494055087689:policy/beatsnext-dev-lambda-s3-sqs-permissions" -> (known after apply)
      ~ id          = "arn:aws:iam::494055087689:policy/beatsnext-dev-lambda-s3-sqs-permissions" -> (known after apply)
      ~ name        = "beatsnext-dev-lambda-s3-sqs-permissions" -> "beatsnext-int-lambda-s3-sqs-permissions"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::beatsnext-dev/*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "sqs:SendMessage",
                          - "sqs:ReceiveMessage",
                          - "sqs:GetQueueAttributes",
                          - "sqs:DeleteMessage",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sqs:us-east-1:494055087689:beatsnext-dev-regeneration-nextjs.fifo"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ policy_id   = "ANPAXGB72LZE26KCXIYIF" -> (known after apply)
      - tags        = {} -> null
      ~ tags_all    = {} -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.cloudfront_s3.aws_iam_role.default_lambda_exec must be replaced
-/+ resource "aws_iam_role" "default_lambda_exec" {
      ~ arn                   = "arn:aws:iam::494055087689:role/beatsnext-dev-LambdaRscExecRole" -> (known after apply)
      ~ create_date           = "2023-03-28T19:00:51Z" -> (known after apply)
      ~ id                    = "beatsnext-dev-LambdaRscExecRole" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::494055087689:policy/beatsnext-dev-lambda-s3-sqs-permissions",
          - "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole",
        ] -> (known after apply)
      ~ name                  = "beatsnext-dev-LambdaRscExecRole" -> "beatsnext-int-LambdaRscExecRole"
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROAXGB72LZEZCOZO2T4Y" -> (known after apply)
        # (4 unchanged attributes hidden)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.cloudfront_s3.aws_iam_role_policy_attachment.attach-s3-sqs must be replaced
-/+ resource "aws_iam_role_policy_attachment" "attach-s3-sqs" {
      ~ id         = "beatsnext-dev-LambdaRscExecRole-20230328190052076500000001" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::494055087689:policy/beatsnext-dev-lambda-s3-sqs-permissions" -> (known after apply)
      ~ role       = "beatsnext-dev-LambdaRscExecRole" -> "beatsnext-int-LambdaRscExecRole"
    }

  # module.cloudfront_s3.aws_iam_role_policy_attachment.default_lambda_policy must be replaced
-/+ resource "aws_iam_role_policy_attachment" "default_lambda_policy" {
      ~ id         = "beatsnext-dev-LambdaRscExecRole-20230328190052077000000002" -> (known after apply)
      ~ role       = "beatsnext-dev-LambdaRscExecRole" -> "beatsnext-int-LambdaRscExecRole"
        # (1 unchanged attribute hidden)
    }

  # module.cloudfront_s3.aws_route53_record.cloudfront_alias_domain will be created
  + resource "aws_route53_record" "cloudfront_alias_domain" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "int.beatsnext.com"
      + type            = "A"
      + zone_id         = "Z06628972TBI5UV1L9HS7"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.cloudfront_s3.aws_s3_bucket.lambda_bucket must be replaced
-/+ resource "aws_s3_bucket" "lambda_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::beatsnext-dev-lambda-bucket" -> (known after apply)
      ~ bucket                      = "beatsnext-dev-lambda-bucket" -> "beatsnext-int-lambda-bucket"
      ~ bucket_domain_name          = "beatsnext-dev-lambda-bucket.s3.amazonaws.com" -> (known after apply)
      ~ bucket_regional_domain_name = "beatsnext-dev-lambda-bucket.s3.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)
      ~ id                          = "beatsnext-dev-lambda-bucket" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "us-east-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      ~ tags_all                    = {} -> (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (1 unchanged attribute hidden)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      - grant {
          - id          = "c606020a98042b1470ecb961a7b56ad07da9a432eeddecf4eee6a79ec6961d89" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }
      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      ~ server_side_encryption_configuration {
          ~ rule {
              ~ bucket_key_enabled = false -> (known after apply)

              ~ apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  ~ sse_algorithm     = "AES256" -> (known after apply)
                }
            }
        }

      ~ versioning {
          ~ enabled    = false -> (known after apply)
          ~ mfa_delete = false -> (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # module.cloudfront_s3.aws_s3_bucket_public_access_block.lambda_bucket must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "lambda_bucket" {
      ~ bucket                  = "beatsnext-dev-lambda-bucket" -> (known after apply)
      ~ id                      = "beatsnext-dev-lambda-bucket" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.cloudfront_s3.aws_sqs_queue.sqs_default_queue must be replaced
-/+ resource "aws_sqs_queue" "sqs_default_queue" {
      ~ arn                               = "arn:aws:sqs:us-east-1:494055087689:beatsnext-dev-regeneration-nextjs.fifo" -> (known after apply)
      ~ id                                = "https://sqs.us-east-1.amazonaws.com/494055087689/beatsnext-dev-regeneration-nextjs.fifo" -> (known after apply)
      ~ kms_data_key_reuse_period_seconds = 300 -> (known after apply)
      ~ name                              = "beatsnext-dev-regeneration-nextjs.fifo" -> "beatsnext-int-regeneration-nextjs.fifo"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      ~ sqs_managed_sse_enabled           = true -> (known after apply)
      - tags                              = {} -> null
      ~ tags_all                          = {} -> (known after apply)
      ~ url                               = "https://sqs.us-east-1.amazonaws.com/494055087689/beatsnext-dev-regeneration-nextjs.fifo" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.cloudfront_s3.module.lambdas["api"].aws_cloudwatch_log_group.default_lambda[0] must be replaced
-/+ resource "aws_cloudwatch_log_group" "default_lambda" {
      ~ arn               = "arn:aws:logs:us-east-1:494055087689:log-group:/aws/lambda/beatsnext-dev_api_path" -> (known after apply)
      ~ id                = "/aws/lambda/beatsnext-dev_api_path" -> (known after apply)
      ~ name              = "/aws/lambda/beatsnext-dev_api_path" -> "/aws/lambda/beatsnext-int_api_path"
      + name_prefix       = (known after apply)
      - tags              = {} -> null
      ~ tags_all          = {} -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.cloudfront_s3.module.lambdas["api"].aws_lambda_function.default_path[0] must be replaced
-/+ resource "aws_lambda_function" "default_path" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:us-east-1:494055087689:function:beatsnext-dev_api_path" -> (known after apply)
      ~ function_name                  = "beatsnext-dev_api_path" -> "beatsnext-int_api_path"
      ~ id                             = "beatsnext-dev_api_path" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:494055087689:function:beatsnext-dev_api_path/invocations" -> (known after apply)
      ~ last_modified                  = "2023-03-28T23:24:35.000+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:494055087689:function:beatsnext-dev_api_path:5" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:494055087689:function:beatsnext-dev_api_path:5/invocations" -> (known after apply)
      ~ role                           = "arn:aws:iam::494055087689:role/beatsnext-dev-LambdaRscExecRole" -> (known after apply)
      ~ s3_bucket                      = "beatsnext-dev-lambda-bucket" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_hash               = "fhkgv999udDu3Fl8gT31ycNfH7cY+aVuJDDCLpfW7Es=" -> "P18DGN6NXlREk52lFYwUvODmZ6brPYd8/Q62QhFl5KM="
      ~ source_code_size               = 1282725 -> (known after apply)
      - tags                           = {} -> null
      ~ tags_all                       = {} -> (known after apply)
      ~ version                        = "5" -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ ephemeral_storage {
          ~ size = 512 -> (known after apply)
        }

      ~ tracing_config {
          ~ mode = "PassThrough" -> (known after apply)
        }
    }

  # module.cloudfront_s3.module.lambdas["api"].aws_s3_object.lambda_default must be replaced
-/+ resource "aws_s3_object" "lambda_default" {
      ~ bucket                 = "beatsnext-dev-lambda-bucket" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "ab62dec5f4f7e9bf6aecce29110f38fb" -> "f15fd12ef7d68296d69cc62cc35b7e69"
      ~ id                     = "api_path.zip" -> (known after apply)
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.cloudfront_s3.module.lambdas["default"].aws_cloudwatch_log_group.default_lambda[0] must be replaced
-/+ resource "aws_cloudwatch_log_group" "default_lambda" {
      ~ arn               = "arn:aws:logs:us-east-1:494055087689:log-group:/aws/lambda/beatsnext-dev_default_path" -> (known after apply)
      ~ id                = "/aws/lambda/beatsnext-dev_default_path" -> (known after apply)
      ~ name              = "/aws/lambda/beatsnext-dev_default_path" -> "/aws/lambda/beatsnext-int_default_path"
      + name_prefix       = (known after apply)
      - tags              = {} -> null
      ~ tags_all          = {} -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.cloudfront_s3.module.lambdas["default"].aws_lambda_function.default_path[0] must be replaced
-/+ resource "aws_lambda_function" "default_path" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:us-east-1:494055087689:function:beatsnext-dev_default_path" -> (known after apply)
      ~ function_name                  = "beatsnext-dev_default_path" -> "beatsnext-int_default_path"
      ~ id                             = "beatsnext-dev_default_path" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:494055087689:function:beatsnext-dev_default_path/invocations" -> (known after apply)
      ~ last_modified                  = "2023-03-28T23:24:35.000+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:494055087689:function:beatsnext-dev_default_path:5" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:494055087689:function:beatsnext-dev_default_path:5/invocations" -> (known after apply)
      ~ role                           = "arn:aws:iam::494055087689:role/beatsnext-dev-LambdaRscExecRole" -> (known after apply)
      ~ s3_bucket                      = "beatsnext-dev-lambda-bucket" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_hash               = "J5iMb+aUMCOfM/jrJpeuFlkgjhU4qrA4KqC4ZGRM0S8=" -> "vClQq+2k/Wa8+xNIKqEvn3o8OUskaKtPx2bd4Qhaj50="
      ~ source_code_size               = 1474685 -> (known after apply)
      - tags                           = {} -> null
      ~ tags_all                       = {} -> (known after apply)
      ~ version                        = "5" -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ ephemeral_storage {
          ~ size = 512 -> (known after apply)
        }

      ~ tracing_config {
          ~ mode = "PassThrough" -> (known after apply)
        }
    }

  # module.cloudfront_s3.module.lambdas["default"].aws_s3_object.lambda_default must be replaced
-/+ resource "aws_s3_object" "lambda_default" {
      ~ bucket                 = "beatsnext-dev-lambda-bucket" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "ef6e442cb97d64970e8e34c8a81aebf3" -> "8fabc1031c6233eb972047c9def8922c"
      ~ id                     = "default_path.zip" -> (known after apply)
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.cloudfront_s3.module.lambdas["image"].aws_s3_object.lambda_default must be replaced
-/+ resource "aws_s3_object" "lambda_default" {
      ~ bucket                 = "beatsnext-dev-lambda-bucket" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ id                     = "image_path.zip" -> (known after apply)
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.cloudfront_s3.module.lambdas["regeneration"].aws_cloudwatch_log_group.default_lambda[0] must be replaced
-/+ resource "aws_cloudwatch_log_group" "default_lambda" {
      ~ arn               = "arn:aws:logs:us-east-1:494055087689:log-group:/aws/lambda/beatsnext-dev_regeneration_path" -> (known after apply)
      ~ id                = "/aws/lambda/beatsnext-dev_regeneration_path" -> (known after apply)
      ~ name              = "/aws/lambda/beatsnext-dev_regeneration_path" -> "/aws/lambda/beatsnext-int_regeneration_path"
      + name_prefix       = (known after apply)
      - tags              = {} -> null
      ~ tags_all          = {} -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.cloudfront_s3.module.lambdas["regeneration"].aws_lambda_event_source_mapping.event_source_mapping[0] must be replaced
-/+ resource "aws_lambda_event_source_mapping" "event_source_mapping" {
      - bisect_batch_on_function_error     = false -> null
      ~ event_source_arn                   = "arn:aws:sqs:us-east-1:494055087689:beatsnext-dev-regeneration-nextjs.fifo" -> (known after apply)
      ~ function_arn                       = "arn:aws:lambda:us-east-1:494055087689:function:beatsnext-dev_regeneration_path" -> (known after apply)
      ~ function_name                      = "arn:aws:lambda:us-east-1:494055087689:function:beatsnext-dev_regeneration_path" -> (known after apply)
      - function_response_types            = [] -> null
      ~ id                                 = "19df5971-9312-4277-9f2f-c0897c35ed3f" -> (known after apply)
      ~ last_modified                      = "2023-03-28T20:07:28Z" -> (known after apply)
      + last_processing_result             = (known after apply)
      - maximum_batching_window_in_seconds = 0 -> null
      ~ maximum_record_age_in_seconds      = 0 -> (known after apply)
      ~ maximum_retry_attempts             = 0 -> (known after apply)
      ~ parallelization_factor             = 0 -> (known after apply)
      - queues                             = [] -> null
      ~ state                              = "Enabled" -> (known after apply)
      ~ state_transition_reason            = "USER_INITIATED" -> (known after apply)
      - topics                             = [] -> null
      - tumbling_window_in_seconds         = 0 -> null
      ~ uuid                               = "19df5971-9312-4277-9f2f-c0897c35ed3f" -> (known after apply)
        # (2 unchanged attributes hidden)

      + amazon_managed_kafka_event_source_config {
          + consumer_group_id = (known after apply)
        }

      + self_managed_kafka_event_source_config {
          + consumer_group_id = (known after apply)
        }
    }

  # module.cloudfront_s3.module.lambdas["regeneration"].aws_lambda_function.default_path[0] must be replaced
-/+ resource "aws_lambda_function" "default_path" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:us-east-1:494055087689:function:beatsnext-dev_regeneration_path" -> (known after apply)
      ~ function_name                  = "beatsnext-dev_regeneration_path" -> "beatsnext-int_regeneration_path"
      ~ id                             = "beatsnext-dev_regeneration_path" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:494055087689:function:beatsnext-dev_regeneration_path/invocations" -> (known after apply)
      ~ last_modified                  = "2023-03-28T23:24:35.000+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:494055087689:function:beatsnext-dev_regeneration_path:5" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:494055087689:function:beatsnext-dev_regeneration_path:5/invocations" -> (known after apply)
      ~ role                           = "arn:aws:iam::494055087689:role/beatsnext-dev-LambdaRscExecRole" -> (known after apply)
      ~ s3_bucket                      = "beatsnext-dev-lambda-bucket" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_hash               = "wH087ts4ItqWRSv1hu1B1k4Jy3/n9KDQ2AJkSRo6O+Y=" -> "eqJZCMFrOxPCI0bKn99eWXWpUrjgdh35r2ylkiNHmtM="
      ~ source_code_size               = 1399961 -> (known after apply)
      - tags                           = {} -> null
      ~ tags_all                       = {} -> (known after apply)
      ~ version                        = "5" -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ ephemeral_storage {
          ~ size = 512 -> (known after apply)
        }

      ~ tracing_config {
          ~ mode = "PassThrough" -> (known after apply)
        }
    }

  # module.cloudfront_s3.module.lambdas["regeneration"].aws_s3_object.lambda_default must be replaced
-/+ resource "aws_s3_object" "lambda_default" {
      ~ bucket                 = "beatsnext-dev-lambda-bucket" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "b2b684d1d219b97c11497753cb026bef" -> "1dece041f8a8e285618ca838985cb71e"
      ~ id                     = "regeneration_path.zip" -> (known after apply)
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 52 to add, 1 to change, 50 to destroy.
```
</details>
*Pushed by: @mamistry, Action: `pull_request`, Working Directory: `int`, Workflow: `pr builds for dev`*